In [2]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

In [11]:
# Series...

# Create a series
series = Series(np.linspace(10,20,5), index = ['a','b','c','d','e'])
series

a    10.0
b    12.5
c    15.0
d    17.5
e    20.0
dtype: float64

In [12]:
# Select a series entry by index alias
series['b']

12.5

In [13]:
# Select a series entry by literal index
series[1]

12.5

In [14]:
# Select section of series with slicing
series[:3]

a    10.0
b    12.5
c    15.0
dtype: float64

In [16]:
# Select multiple entries by passing a list of index aliases
series[['b','e','a']]

b    12.5
e    20.0
a    10.0
dtype: float64

In [18]:
series>15

a    False
b    False
c    False
d     True
e     True
dtype: bool

In [20]:
series[series>15]

d    17.5
e    20.0
dtype: float64

In [22]:
# Update values for a selection of indices
series[series>15] = 0
series

a    10.0
b    12.5
c    15.0
d     0.0
e     0.0
dtype: float64

In [24]:
# DataFrames...

# Create a new DataFramem
df = DataFrame(np.linspace(0,100,25).reshape((5,5)),index=np.arange(5),columns=['a','b','c','d','e'])
df

           a          b          c          d           e
0   0.000000   4.166667   8.333333  12.500000   16.666667
1  20.833333  25.000000  29.166667  33.333333   37.500000
2  41.666667  45.833333  50.000000  54.166667   58.333333
3  62.500000  66.666667  70.833333  75.000000   79.166667
4  83.333333  87.500000  91.666667  95.833333  100.000000

In [31]:
# Select a column - returns a series
df["c"]

0     8.333333
1    29.166667
2    50.000000
3    70.833333
4    91.666667
Name: c, dtype: float64

In [33]:
# Select multiple columns - returns a df
df[["b", "e", "a"]]

           b           e          a
0   4.166667   16.666667   0.000000
1  25.000000   37.500000  20.833333
2  45.833333   58.333333  41.666667
3  66.666667   79.166667  62.500000
4  87.500000  100.000000  83.333333

In [38]:
# Select a row
df.loc[2]

a    41.666667
b    45.833333
c    50.000000
d    54.166667
e    58.333333
Name: 2, dtype: float64

In [39]:
# Returns a
df["c"] > 50

0    False
1    False
2    False
3     True
4     True
Name: c, dtype: bool

In [40]:
df[df["c"] > 50]

           a          b          c          d           e
3  62.500000  66.666667  70.833333  75.000000   79.166667
4  83.333333  87.500000  91.666667  95.833333  100.000000